zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXA276VPN-pinctrl.h
#define TRIG_IN11_P3_28 A15X_MUX('3',28,1) /* PT3_28 */
#define LPI2C3_SDA_P3_28 A15X_MUX('3',28,2) /* PT3_28 */
#define LPUART4_RXD_P3_28 A15X_MUX('3',28,3) /* PT3_28 */
#define TRIG_IN11/CT_INP12_P3_28_P3_28 A15X_MUX('3',28,4) /* PT3_28 */
#define CT_INP12_P3_28 A15X_MUX('3',28,4) /* PT3_28 */
#define CT3_MAT2_P3_28 A15X_MUX('3',28,5) /* PT3_28 */
#define FLEXIO0_D28_P3_28 A15X_MUX('3',28,6) /* PT3_28 */
#define PWM1_B3_P3_28 A15X_MUX('3',28,7) /* PT3_28 */
#define SmartDMA_PIO28_P3_28 A15X_MUX('3',28,10) /* PT3_28 */
#define ADC1_A22_P3_29 A15X_MUX('3',29,0) /* PT3_29 */
#define WUU0_IN27_P3_29 A15X_MUX('3',29,0) /* PT3_29 */
#define P3_29 A15X_MUX('3',29,0) /* PT3_29 */
#define ISPMODE_N_P3_29 A15X_MUX('3',29,1) /* PT3_29 */
#define LPI2C3_HREQ_P3_29 A15X_MUX('3',29,2) /* PT3_29 */
#define CT_INP3_P3_29 A15X_MUX('3',29,4) /* PT3_29 */
#define CT3_MAT3_P3_29 A15X_MUX('3',29,5) /* PT3_29 */
#define FLEXIO0_D29_P3_29 A15X_MUX('3',29,6) /* PT3_29 */
#define SmartDMA_PIO29_P3_29 A15X_MUX('3',29,10) /* PT3_29 */
#define P3_30 A15X_MUX('3',30,0) /* PT3_30 */
#define ADC1_A21_P3_30 A15X_MUX('3',30,0) /* PT3_30 */
#define TRIG_OUT6_P3_30 A15X_MUX('3',30,1) /* PT3_30 */
#define LPI2C3_SCLS_P3_30 A15X_MUX('3',30,2) /* PT3_30 */
#define LPUART4_RTS_B_P3_30 A15X_MUX('3',30,3) /* PT3_30 */
#define CT0_MAT2_P3_30 A15X_MUX('3',30,4) /* PT3_30 */
#define FLEXIO0_D30_P3_30 A15X_MUX('3',30,6) /* PT3_30 */
#define PWM1_A0_P3_30 A15X_MUX('3',30,7) /* PT3_30 */
#define SmartDMA_PIO30_P3_30 A15X_MUX('3',30,10) /* PT3_30 */
#define P3_31 A15X_MUX('3',31,0) /* PT3_31 */
#define ADC1_A20_P3_31 A15X_MUX('3',31,0) /* PT3_31 */
#define LPTMR0_ALT2_P3_31 A15X_MUX('3',31,0) /* PT3_31 */
#define TRIG_IN10_P3_31 A15X_MUX('3',31,1) /* PT3_31 */
#define LPI2C3_SDAS_P3_31 A15X_MUX('3',31,2) /* PT3_31 */
#define LPUART4_CTS_B_P3_31 A15X_MUX('3',31,3) /* PT3_31 */
#define CT0_MAT3_P3_31 A15X_MUX('3',31,4) /* PT3_31 */
#define FLEXIO0_D31_P3_31 A15X_MUX('3',31,6) /* PT3_31 */
#define PWM1_B0_P3_31 A15X_MUX('3',31,7) /* PT3_31 */
#define SmartDMA_PIO31_P3_31 A15X_MUX('3',31,10) /* PT3_31 */
#define P4_0 A15X_MUX('4',0,0) /* PT4_0 */
#define ADC2_A16_P4_0 A15X_MUX('4',0,0) /* PT4_0 */
#define TRIG_IN5_P4_0 A15X_MUX('4',0,1) /* PT4_0 */
#define PWM0_A3_P4_0 A15X_MUX('4',0,5) /* PT4_0 */
#define FLEXIO0_D8_P4_0 A15X_MUX('4',0,6) /* PT4_0 */
#define SmartDMA_PIO20_P4_0 A15X_MUX('4',0,7) /* PT4_0 */
#define P4_1 A15X_MUX('4',1,0) /* PT4_1 */
#define ADC2_A17_P4_1 A15X_MUX('4',1,0) /* PT4_1 */
#define PWM0_B3_P4_1 A15X_MUX('4',1,5) /* PT4_1 */
#define FLEXIO0_D9_P4_1 A15X_MUX('4',1,6) /* PT4_1 */
#define SmartDMA_PIO21_P4_1 A15X_MUX('4',1,7) /* PT4_1 */
#define P4_2 A15X_MUX('4',2,0) /* PT4_2 */
#define ADC2_A18_P4_2 A15X_MUX('4',2,0) /* PT4_2 */
#define WUU0_IN16_P4_2 A15X_MUX('4',2,0) /* PT4_2 */
#define CLKOUT_P4_2 A15X_MUX('4',2,1) /* PT4_2 */
#define LPI2C2_SDAS_P4_2 A15X_MUX('4',2,2) /* PT4_2 */
#define LPUART3_RXD_P4_2 A15X_MUX('4',2,3) /* PT4_2 */
#define CT4_MAT0_P4_2 A15X_MUX('4',2,4) /* PT4_2 */
#define PWM0_A2_P4_2 A15X_MUX('4',2,5) /* PT4_2 */
#define FLEXIO0_D10_P4_2 A15X_MUX('4',2,6) /* PT4_2 */
#define SmartDMA_PIO22_P4_2 A15X_MUX('4',2,7) /* PT4_2 */
#define P4_3 A15X_MUX('4',3,0) /* PT4_3 */
#define ADC2_A19_P4_3 A15X_MUX('4',3,0) /* PT4_3 */
#define LPI2C2_SCL_P4_3 A15X_MUX('4',3,2) /* PT4_3 */
#define LPUART4_TXD_P4_3 A15X_MUX('4',3,3) /* PT4_3 */
#define CT4_MAT1_P4_3 A15X_MUX('4',3,4) /* PT4_3 */
#define PWM0_B2_P4_3 A15X_MUX('4',3,5) /* PT4_3 */
#define FLEXIO0_D11_P4_3 A15X_MUX('4',3,6) /* PT4_3 */
#define SmartDMA_PIO23_P4_3 A15X_MUX('4',3,7) /* PT4_3 */
#define ADC2_A20_P4_4 A15X_MUX('4',4,0) /* PT4_4 */
#define WUU0_IN17_P4_4 A15X_MUX('4',4,0) /* PT4_4 */
#define P4_4 A15X_MUX('4',4,0) /* PT4_4 */
#define LPI2C2_SDA_P4_4 A15X_MUX('4',4,2) /* PT4_4 */
#define LPUART4_RXD_P4_4 A15X_MUX('4',4,3) /* PT4_4 */
#define CT4_MAT2_P4_4 A15X_MUX('4',4,4) /* PT4_4 */
#define PWM0_A1_P4_4 A15X_MUX('4',4,5) /* PT4_4 */
#define FLEXIO0_D12_P4_4 A15X_MUX('4',4,6) /* PT4_4 */
#define SmartDMA_PIO24_P4_4 A15X_MUX('4',4,7) /* PT4_4 */
#define P4_5 A15X_MUX('4',5,0) /* PT4_5 */
#define ADC2_A21_P4_5 A15X_MUX('4',5,0) /* PT4_5 */
#define TRIG_OUT3_P4_5 A15X_MUX('4',5,1) /* PT4_5 */
#define LPI2C2_SCLS_P4_5 A15X_MUX('4',5,2) /* PT4_5 */
#define LPUART3_TXD_P4_5 A15X_MUX('4',5,3) /* PT4_5 */
#define CT4_MAT3_P4_5 A15X_MUX('4',5,4) /* PT4_5 */
#define PWM0_B1_P4_5 A15X_MUX('4',5,5) /* PT4_5 */
#define FLEXIO0_D13_P4_5 A15X_MUX('4',5,6) /* PT4_5 */
#define SmartDMA_PIO25_P4_5 A15X_MUX('4',5,7) /* PT4_5 */
#define P4_6 A15X_MUX('4',6,0) /* PT4_6 */
#define ADC2_A22_P4_6 A15X_MUX('4',6,0) /* PT4_6 */
#define TRIG_IN4_P4_6 A15X_MUX('4',6,1) /* PT4_6 */
#define TRIG_IN4/CT_INP6_P4_6_P4_6 A15X_MUX('4',6,1) /* PT4_6 */
#define LPI2C2_HREQ_P4_6 A15X_MUX('4',6,2) /* PT4_6 */
#define LPUART3_CTS_B_P4_6 A15X_MUX('4',6,3) /* PT4_6 */
#define CT_INP6_P4_6 A15X_MUX('4',6,4) /* PT4_6 */
#define PWM0_A0_P4_6 A15X_MUX('4',6,5) /* PT4_6 */
#define FLEXIO0_D14_P4_6 A15X_MUX('4',6,6) /* PT4_6 */
#define SmartDMA_PIO26_P4_6 A15X_MUX('4',6,7) /* PT4_6 */
#define P4_7 A15X_MUX('4',7,0) /* PT4_7 */
#define ADC2_A23_P4_7 A15X_MUX('4',7,0) /* PT4_7 */
#define TRIG_IN5_P4_7 A15X_MUX('4',7,1) /* PT4_7 */
#define LPUART3_RTS_B_P4_7 A15X_MUX('4',7,3) /* PT4_7 */
#define CT_INP7_P4_7 A15X_MUX('4',7,4) /* PT4_7 */
#define TRIG_IN5/CT_INP7_P4_7_P4_7 A15X_MUX('4',7,4) /* PT4_7 */
#define PWM0_B0_P4_7 A15X_MUX('4',7,5) /* PT4_7 */
#define FLEXIO0_D15_P4_7 A15X_MUX('4',7,6) /* PT4_7 */
#define SmartDMA_PIO27_P4_7 A15X_MUX('4',7,7) /* PT4_7 */
#endif
